Revit 2027 API
ImageInstance.IsValidView Method
 Check that the view is a valid view for ImageInstance elements
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidView(
	View view
)
Public Shared Function IsValidView (
	view As View
) As Boolean
public:
static bool IsValidView(
	View^ view
)
static member IsValidView :
        view : View -> bool
Parameters
view View
 The view to validate
Return Value
Boolean
 True if the view can contain ImageInstance elements. False otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ImageInstance Class
Autodesk.Revit.DB Namespace